Repository: kamperh/kamperh.github.io
Catalog: data/siyavula_en_af.3.tmx
Source language: en
Languages: af

source: make sure you do not use any modern tools or any metal glass or plastic as it is highly unlikely that you would have any such items to use 250 years ago .
af: maak seker dat jy nie enige moderne gereedskap of metaal glas of plastiek gebruik nie aangesien jy nie 300 jaar gelede hierdie items sou h nie .

source: list the possible dangers that you will face in your new 'home' .
af: maak 'n lys van die moontlike gevare waaraan jy in jou nuwe tuiste blootgestel kan word .

source: can you predict how the locals will look and how they will treat you ?
af: kan jy voorspel hoe die plaaslike bevolking sal lyk en hoe hulle jou sal behandel ?

source: describe your first night there .
af: beskryf die eerste nag daar .

source: explain how you will decide what you can and cannot eat on your first day .
af: verduidelik hoe jy sal besluit wat jy op die eerste dag daar kan eet en wat jy nie kan eet nie .

source: complete this sentence if i want to preserve some of the fish i catch i will.. .
af: voltooi hierdie sin indien ek van die vis wat ek vang wil bewaar moet ek.. .

source: start this lesson by brainstorming different types of processed foods and facilitating discussion to try and agree on a class definition for 'processed food' .
af: begin die les met 'n dinkskrum oor verwerkte voedsel en fasiliteer die bespreking om te probeer om tot 'n klasdefinisie te kom vir verwerkte voedsel .

source: it should be clear after this discussion that
af: dit moet n hierdie bespreking duidelik wees dat

source: make a class list of possible reasons why food is processed and possible examples of people who would benefit from this processing write this on newsprint or poster paper to refer and add to as you go .
af: maak 'n klaslys van moontlike redes hoekom voedsel verwerk word en moontlik voorbeelde van mense wat hierdeur bevoordeel kan word skryf dit op koerant of plakkaatpapier om na terug te verwys of by te voeg soos wat u voortgaan .

source: hundreds of years ago explorers like columbus da gama and diaz had to pack supplies for their crews to last a very long time should they not find food and water on their expeditions .
af: honderde jare gelede moes ontdekkingsreisigers soos columbus da gama en diaz vir die bemanning voorrade pak wat baie lank kon hou indien hulle nie kos en water tydens hulle ekspedisies kon vind nie .

source: they too had to take as much preserved food and drink as they could .
af: hulle moes dus ook soveel as moontlik gepreserveerde voedsel en drank saamneem .

source: many of the foods we eat today cannot be eaten in their raw form we need to process the food to make it edible .
af: baie van die voedselsoorte wat ons vandag eet kan nie rou geet word nie ons moet dit verwerk om dit verteerbaar te maak .

source: sometimes food is also processed to add to its nutritional value for example when we ferment dairy products to make yogurt cheese and buttermilk .
af: soms word voedselsoorte ook verwerk om die voedingswaarde te verhoog byvoorbeeld wanneer ons suiwelprodukte fermenteer om jogurt kaas en karringmelk te maak .

source: there are many reasons to process food .
af: daar is verskeie redes waarom ons voedsel verwerk .

source: can you think of any ?
af: kan jy aan enige redes dink ?

source: when you get home today ask your parents family members and maybe your friends' parents if they think processed food is good or bad and why they say so .
af: wanneer jy vandag by die huis kom vra jou ouers ander gesinslede en moontlik ook jou vriende se ouers of hulle dink verwerkte voedsel is goed of sleg en hoekom hulle so s .

source: write the results of what you learnt from this quick survey below .
af: skryf jou bevindings van hierdie vinnige opname hieronder neer .

source: food processing adds many benefits to our modern lives
af: voedselverwerking hou baie voordele vir ons moderne lewens in

source: the emperor of france napoleon bonaparte launched a competition in france in 1975 to develop ways to preserve foods for france's armies !
af: in die 1790's het napoleon bonaparte 'n kompetisie in frankryk geloods vir wetenskaplikes om maniere te ontwikkel om kos vir die franse weermag te preserveer !

source: this led to the discovery of canning .
af: dit hetgelei tot die ontdekking van blikkieskos .

source: making cheese at home video http www.youtube.com watch?v awx8vlnt8zy
af: maak kaas by die huis video . goo.gl evlhg

source: pickling vegetables video http www.youtube.com watch?v 103mpng1jp8&amp;feature related
af: die inmaak van groente video . http www.youtube.com watch?v 103mpng1jp8&amp;feature related

source: making plum jam video http www.youtube.com watch?v efipgpis9bm&amp;feature fvwrel
af: hoe om pruimkonfyt te kook video . http www.youtube.com watch?v efipgpis9bm&amp;feature fvwrel

source: raw meat
af: rou vleis

source: yoghurt
af: jogurt

source: pickled gherkins
af: ingemaakte agurkies

source: glac cherries
af: glanskersies

source: fried eggs
af: gebakte eiers

source: cheese
af: kaas

source: butternut
af: botterskorsie

source: frozen meals
af: gevriesde maaltye

source: we have seen that processed foods have many advantages in our modern lives but processed foods also have drawbacks disadvantages especially if they have been over processed .
af: ons het gesien dat geprosesseerde voedsel baie voordele inhou as deel van ons moderne leefstyl maar dit het ook nadele veral as dit rgeprosesseer word .

source: write down some possible reasons why people think processed food is not good for you .
af: skryf 'n paar moontlike redes neer waarom mense dink dat geprosesseerde voedsel nie goed vir 'n mens is nie .

source: class discussion discuss the results of their homework surveys with the class and make a mindmap on the board showing the possible reasons why people do or don't think processed food is good for you .
af: klasbespreking bespreek die resultate van die leerders se huiswerk in die klas en maak 'n breinkaart op die bord wat die moontlike redes aantoon waarom mense dink dat verwerkte voedsels goed vir 'n mens is of nie .

source: the following information must be used to facilitate the class discussion .
af: die volgende inligting moet gebruik word om die klasbespreking te fasiliteer .

source: make sure to write the main points on the board so that learners can copy the main headings down .
af: maak seker u skryf die hoofpunte op die bord neer sodat leerders die opskrifte kan neerskryf .

source: also encourage learners to take down some additional notes .
af: moedig ook die leerders aan om ekstra notas te maak .

source: this is an important skill for their school career .
af: dit is 'n belangrike vaardigheid vir hul skoolloopbaan .

source: there are different ways to process food but in almost all of these ways some of the nutrients vitamins and minerals are destroyed .
af: daar is verskillende maniere om voedsel te verwerk maar byna al die maniere laat sekere van die voedingstowwe vitamiene en minerale verlore gaan .

source: any process that uses heat generally also destroys vitamin c for example .
af: enige proses wat hitte gebruik vernietig byvoorbeeld vitamien c .

source: however people tend to think that here is very little nutrients left in processed food when this is actually not the case .
af: mense neig egter om te dink dat daar baie min voedingstowwe in verwerkte kos oorbly terwyl dit inderwaarheid nie die geval is nie .

source: research has shown that only between 5 20 of nutrients are lost when food is processed in a factory or a home .
af: navorsing toon dat slegs sowat 5 20 van die voedingstowwe verlore gaan wanneer die voedsel verwerk word hetsy in 'n fabriek of by die huis .

source: the amount of nutrient loss depends on the method used to process the food .
af: die hoeveelheid voedingstowwe wat verlore gaan word bepaal deur die metode wat gebruik word om die voedsel te verwerk .

source: you might have heard that there are dangerous additives in processed food that make it very bad for you .
af: jy mag dalk al gehoor het dat daar gevaarlike bymiddels in verwerkte kos is wat baie sleg vir jou kan wees .

source: in the past many food manufacturers have in fact added many extra products to food
af: in die verlede het baie voedselprodusente wel baie ekstra produkte by kos gegooi

source: the caps require that learners research different ways of processing food raw material and then choose one way and process food raw material using this method .
af: die kabv vereis dat leerders verskillende maniere van voedselprosessering van rou materiale navors en dan een manier kies en 'n voedselsoort rou materiaal verwerk deur hierdie metode te gebruik .

source: we have set this out as a project that teachers can use to assess .
af: ons het dit uiteengesit as 'n projek wat onderwysers vir assessering kan gebruik .

source: the unit briefly introduces some of the ways of processing food and very briefly touches on each of these .
af: die eenheid stel kortliks van die maniere om voedsel te verwerk bekend en gee kortliks aandag aan elk .

source: learners are then required to research their preferred method and present their research using various methods like posters slideshows in powerpoint etc about this method of food processing .
af: daar word dan van leerders verwag om die metode van hulle keuse na te vors en om hulle navorsing voor te hou deur verskillende maniere te gebruik soos plakkate skyfie aanbiedings in powerpoint ens .

source: they also need to process food raw material using this method and demonstrate the steps they followed to their class .
af: hulle moet ook voedsel rou materiaal verwerk deur hierdie metode te volg en aan die klas demonstreer watter stappe hulle gevolg het .

source: there are different levels of food processing .
af: daar is verskillende vlakke van voedselprosessering .

source: the key question is to ask has any process occurred from when this plant or animal was in its natural habitat to where it is now ?
af: die kernvraag om te vra is het enige proses plaasgevind vanwaardie plant of dier in sy natuurlike omgewing was tot waar dit nou is ?

source: if you can say yes then you know that it has been processed in some way or another .
af: as jy ja kan s dan weet jy dit is op een of ander maniergeprosesseer .

source: many indigenous south african cultures leave milk to curdle in a hide sack or calabash to form a favourite semi solid sour yoghurt drink .
af: baie van die inheemse suid afrikaanse kulture verkies om melk om laat dik te word in 'n velsak of kalbas om 'n semi vaste suur drankie te vorm .

source: this drink is called amasi .
af: dit word amasi genoem .

source: mealie meal made by grinding maize forms a huge part of the diet in many indigenous cultures in southern africa such as the ndebele zulu and swazi .
af: mieliemeel wat gemaak word deur mielies fyn te maal vorm 'n groot deel van die dieet van baieinheemse kulture in suider afrika bv. van die ndebeles zoeloes en swazi's .

source: the table below shows how a raw product is processed to make a raw ingredient which looks very different to the original raw product .
af: die tabel hieronder toon aan hoe 'n rou produk geprosesseer word om 'n geprosesseerde rou bestanddeel te maak wat baie anders as die oorspronklike rou produk lyk .

source: then the processed raw ingredients are used to make highly processed foods such as bread .
af: dan word die geprosesseerde rou bestanddele gebruik om hoogsgeprosesseerde voedsel soos brood te maak .

source: the swazi people make marula beer by placing the ripe fruit in large traditional pots and letting them ferment .
af: die swazi's maak maroelabier deur die ryp vrugte in groot tradisionele potte te sit en dit dan te laat fermenteer gis .

source: sometimes we are presented with a lot of information and we need to condense it to make it easier to remember .
af: soms word 'n groot hoeveelheid inligting aan ons deurgegee en ons moet dit saamvat sodat dit vir ons makliker is om te onthou .

source: this is called summarising and it is a very useful skill .
af: dit word 'n opsomming genoem en dit is 'n baie waardevollevaardigheid .

source: this question is aimed to help learners to summarise information into a table format .
af: hierdie vraag is daarop gemik om leerders te help om inligting in tabelvorm op te som .

source: if they are finding this difficult start them off with drawing the outline of the table on the board and filling in some of the information .
af: as hulle dit moeilik vind help hulle om te begin deur die buitelyne van die tabel op die bord te teken en van die inligting in te vul .

source: one possible solution for a table is given below .
af: een moontlike oplossing vir 'n tabel volg hieronder .

source: products that undergo very little processing
af: produkte wat baie min prosessering ondergaan

source: products that have been drastically changed and the ingredient does not look like the original
af: produkte wat drasties verander is en die bestandeel lyk nie soos die oorspronklike nie

source: products consisting of a combination of processed ingredients .
af: produkte wat bestaan uit 'n kombinasie van geprosesseerde bestanddele

source: fruit and vegetables milk nuts meat
af: vrugte en groente melk neute vleis

source: flour sugar oil syrup .
af: meel suiker olie stroop

source: snacks biscuits desserts meat products such as fish fingers boerewors etc .
af: snoeperye koekies nageregte vleisprodukte soos visvingers boerewors ens .

source: as you could see in the above breakdown the degree in which food is processed determines many of the food preserving processes involved .
af: soos jy in die opsomming hierbo kan sien bepaal die vlak waarop voedsel geprosesseer word baie van die voedselpreserveringsprosesse wat daarby betrokke is .

source: dr j .
af: dr .

source: h .
af: j.h .

source: kellogg invented a type of granola cereal in 1860 it was meant for seventh day adventists who were following a very strict diet .
af: kellogg het in 1860 'n tipe granola ontbytkos ontwerp dit was bedoel vir die sewendedagadventiste wat 'n baie streng dieet gevolg het .

source: later his brother joined him and they started their company kelloggs !
af: later het sy broer by homaangesluit en hulle het die kelloggs maatskappygestig !

source: do you think they were successful? !
af: dink jy hulle was suksesvol? !

source: food processing methods have changed in many ways but the basic principles are still applied .
af: voedselprosesseringsmetodes het in baie opsigte verander maar die basiese beginsels word steeds toegepas .

source: food is still dried or heated to preserve it just like people did 300 years ago but there are many modern methods that are also used today .
af: voedsel word steeds gedroog of verhit om dit te preserveer net soos mense 300 jaargelede gedoen het maar daar word vandag ook baie moderne metodes gebruik .

source: the ndebele people of southern africa eat a plant called umrorho .
af: die ndebeles van suider afrika eet 'n plant wat umrorho genoem word .

source: it is cooked or dried by spreading it out in the sun so that it can be stored for the cold winter months .
af: dit word gekook en gedroog deur dit oop te sprei in die son sodat dit vir die wintermaande gestoor kan word .

source: when you go home from school today make a list of the food products that you have at your house whether they are in the cupboard the fridge or the freezer .
af: wanneer jy vandag n skool huis toe gaan maak 'n lys van al die produkte wat by jou huis is of dit nou in die kruidenierskas yskas of vrieskas is .

source: next to each item write down the type of processing it might have gone through using the list above as a guideline .
af: skryf langs elke item neer watter tipe prosessering gebruik is deur die lys hierbo as 'n riglyn te gebruik .

source: no matter what food processing method is used there are 5 extremely important performance parameters that all food processing must adhere to
af: dit maak nie saak watter voedselprosesseringsmetode gebruik is nie; daar is vyf belangrike vereistes waaraan alle voedselprosessering moet voldoen

source: discuss why you think each of these 5 points are important in food processing .
af: bespreek waarom jy dink hierdie vyf vereistes belangrik in voedselprosessering is .

source: you might need to do some extra reading and have a class discussion .
af: jy mag dalk bykomende leeswerk moet doen en 'n klasbespreking h .

source: below are guidelines to facilitate the discussion and answers .
af: hieronder volg riglyne om die bespreking te fasiliteer met moontlike antwoorde .

source: we have learnt a lot about food processing methods in our modern lives .
af: ons het al baie geleer oor voedselprosesseringsmetodes in ons moderne lewens .

source: however the indigenous people of southern africa have been preserving and processing food for many generations and still use some of their traditional methods today .
af: die inheemse bevolkings van suider afrika het egter al vele geslagte lank voedsel gepreserveer en geprosesseer.sommige van hulle tradisionele metodes word selfs vandag nog gebruik .

source: beer utshwala forms an integral part in the zulu culture especially at social gatherings and traditional ceremonies .
af: bier utshwala speel 'n belangrike rol in die zoeloe kultuur veral by sosiale byeenkomste en tradisionele seremonies .

source: zulu beer is traditionally made by the women .
af: zoeloe bier word tradisioneel deur die vroue gemaak .

source: to brew the beer the women soak coarse sorghum and maize in water for one day typically in a big drum like imbiza pot .
af: om die bier te brou week die vroue growwe sorghum en mielies vir 'n dag lank in water in 'n tipe dromvormige imbiza ysterpot .

source: the following day the broth is boiled over a fire and more dry sorghum is added to the mixture .
af: die volgende dag word die mengsel oor 'n vuur gekook en meer sorghum word bygevoeg .

source: after this the mixture is mashed together and then allowed to cool for the rest of the day .
af: hierna word die mengsel fyngemaak en toegelaat om die res van die dag af te koel .

source: the next day day 3 of the brewing process the mixture is filtered through a sieve to remove the big fibres .
af: die volgende dag dag 3 van die brouproses word die mengsel deur 'n sif gefiltreer om die groot veselstukke te verwyder .

source: the sieve is made from palm fronds and the brew is poured from the big imbiza vessel into the serving vessel iphangela made from clay .
af: die sif word gemaak van palmblare en die brousel word van die groot imbiza houer in die opdieningsfles iphangela wat van klei gemaak is gegooi .

source: the beer is now ready to be served .
af: die bier is gereed om bedien te word .

source: the iphangela is carried from breweryin the kraal a semi thatched hut which allows the smoke from the fire to escape and ensures a good supply of oxygen to ferment the mixture to the drinking assembly .
af: die iphangela word vandie brouery in die kraal 'n half bedekte hut wat die rook van die vuur toelaat om te ontsnap om goeie suurstofvoorsiening te verseker wat die brousel sal laat fermenteer gis gedra na die plek waar hulle vergader om dit te drink .

source: a woman scoops the beer into a drinking vessel ukhamba a small round clay pot decorated with traditional patterns using a dried gourd and presents it on her knees to the men .
af: 'n vrou skep die bier in 'n houer ukhamba 'n klein ronde kleipotjie wat met tradisionele patrone versier is deur 'n gedroogde kalbas te gebruik en bied dit op haar knie vir die mansaan .

source: she will first taste the beer to show the head of the household that she has brewed the beer properly and then hand him the ukhamba before passing it around to the rest .
af: sy sal eers aan die bier proe om vir die hoofman te wys dat sy die bier ordentlik gebrou het .

source: the beer contains 3 alcohol and it is nutritious as it is made from plant products without modern additives or colourants .
af: dan oorhandig sy die ukhamba voordat sy dit na die res aanstuur .

source: what are the ingredients used to make utshwala ?
af: watter bestanddele word gebruik om utshwala te maak ?

source: sorghum dried sorghum maize and water
af: sorghum gedroogde sorghum mieliemeel en water

source: what are the zulu names for the three different clay pots vessels used in the beer making process ?
af: wat is die zoeloe name vir die drie verskillende kleipotte houers wat in die biermaakproses gebruik word ?

source: imbiza brewing vessel iphangela serving vessel ukhamba drinking vessel
af: imbiza broupot iphangela opdienpot ukhamba drinkhouer

source: what are these vessels made from ?
af: waarvan word hierdie houers gemaak ?

source: why does the brewery hut only have a semi thatched roof and not a fully enclosed roof ?
af: waarom het die brouershut slegs 'n halfbedekte grasdak en nie 'n volle grasdak nie ?

source: this is because the women have to make a fire inside to boil the mixture .
af: dit is omdat die vroue moet vuurmaak binne in die hut om die mengsel te kook .

source: so they need an opening to allow the smoke to escape and they need a supply of oxygen for the fire to burn and the fermentation process .
af: hulle het dus 'n opening nodig om die rook te laat ontsnap en om suurstof in te laat om die vuur te laat brand en die fermentasieproses te laat plaasvind .

source: use the space below to draw a flow diagram to illustrate the zulu beer making process .
af: gebruik die ruimte hieronder om 'n vloeidiagram te teken en die biermaakproses te illustreer .

source: remember to include arrows to show the direction .
af: onthou om pyltjies in te sluit en die rigting aan te dui .

source: for the following task you need to do some research outside of class using books and the internet .
af: vir die volgende opdrag sal jy 'n bietjie navorsing buite die klaskamer moet doen deur boeke en die internet te gebruik .

source: find out how beer is made in a modern brewery such as the south african brewery in newlands cape town .
af: vind uit hoe bier in moderne brouerye gemaak word soos by die suid afrikaanse brouery in nuweland kaapstad .

source: in the space below write a paragraph where you compare this modern beer making process to the indigenous method of the zulu people .
af: skryf 'n paragraaf in die ruimte hieronder waarin jy die moderne biermaakproses met die inheemse metode van die zoeloes vergelyk .

source: now that you have a better idea of the different ways that raw food can be processed choose one particular method that you found really interesting to further research and then process the food at the end .
af: noudat jy 'n beter idee het van die verskillende maniere waarop rou voedsel geprosesseer kan word kies een spesifieke metode wat jy regtig interessant gevind het om verdere navorsing te doen en dan die voedsel aan die einde te prosesseer .

source: after researching the method learners are encouraged to actually carry out the food processing either at home or in class .
af: na die navorsing oor die metode word leerders aangemoedig om die voedselverwerking uit te voer hetsy in die klas of by die huis .

source: on a specified day when learners present their projects they can bring the actual food product to class for others to taste .
af: op die dag wat die leerders hulle projekte voorhou kan hulle die voedselproduk klas toe bring vir ander om aan te proe .

source: teacher note below is a guideline rubric to assess each learner's project .
af: nota aan onderwyser hieronder is 'n merkskema as riglyn om elke leerder se projek te assesseer .

source: research skills
af: navorsings vaardighede

source: rigorous pursuit of knowledge and understanding; information paraphrased very clearly .
af: nougesette najaag van kennis en begrip; inligting baie duidelik opgesom .
